{
  "nodes": [
    {
      "op": "null", 
      "name": "vgg0_pool0_fwd", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "pad5", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv2_weight", 
      "attrs": {"__shape__": "(128, 64, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv2_bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "vgg0_relu2_fwd", 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad6", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv3_weight", 
      "attrs": {"__shape__": "(128, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv3_bias", 
      "attrs": {"__shape__": "(128,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "vgg0_relu3_fwd", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad7", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad8", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv4_weight", 
      "attrs": {"__shape__": "(256, 128, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv4_bias", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "vgg0_relu4_fwd", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad9", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv5_weight", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv5_bias", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution6", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "vgg0_relu5_fwd", 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad10", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv6_weight", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv6_bias", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution7", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "vgg0_relu6_fwd", 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad11", 
      "attrs": {
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv7_weight", 
      "attrs": {"__shape__": "(256, 256, 3, 3)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vgg0_conv7_bias", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution8", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "relu", 
      "name": "vgg0_relu7_fwd", 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad12", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 0, 0, 0, 0)"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[33, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    7, 
    8, 
    14, 
    15, 
    19, 
    20, 
    24, 
    25, 
    29, 
    30
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35
  ], 
  "heads": [[34, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}